Backend/loadtest/k6/results/redis/crud/report-2026-07-29-235516.txt
     ✓ login succeeded
     ✓ create succeeded
     ✓ rename succeeded
     ✓ dashboard succeeded
     ✓ delete succeeded

     checks.........................: 100.00% ✓ 990       ✗ 0   
     data_received..................: 768 kB  11 kB/s
     data_sent......................: 406 kB  5.6 kB/s
     http_req_blocked...............: avg=23.39µs  min=0s      med=0s      max=9.49ms   p(90)=0s       p(95)=0s      
     http_req_connecting............: avg=11.75µs  min=0s      med=0s      max=2.06ms   p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=83.7ms   min=36.56ms med=81.2ms  max=255.59ms p(90)=122.53ms p(95)=131.99ms
       { expected_response:true }...: avg=83.7ms   min=36.56ms med=81.2ms  max=255.59ms p(90)=122.53ms p(95)=131.99ms
     http_req_failed................: 0.00%   ✓ 0         ✗ 1188
     http_req_receiving.............: avg=108.32µs min=0s      med=0s      max=1.52ms   p(90)=555.07µs p(95)=640.21µs
     http_req_sending...............: avg=10.67µs  min=0s      med=0s      max=614.4µs  p(90)=0s       p(95)=0s      
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=83.58ms  min=36.56ms med=81.04ms max=255.59ms p(90)=122.46ms p(95)=131.92ms
     http_reqs......................: 1188    16.416079/s
     iteration_duration.............: avg=4s       min=3.95s   med=3.99s   max=4.24s    p(90)=4.03s    p(95)=4.04s   
     iterations.....................: 198     2.736013/s
     vus............................: 1       min=1       max=20
     vus_max........................: 20      min=20      max=20